Revit 2027 API
DocumentSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DocumentSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As DocumentSetIterator
public:
virtual DocumentSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> DocumentSetIterator
override ForwardIterator : unit -> DocumentSetIterator
Return Value
DocumentSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
DocumentSet Class
Autodesk.Revit.DB Namespace